Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	
	РегистрационныеДанные.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	РегистрационныеДанные.БезопасныйРежим = Ложь;
	РегистрационныеДанные.Версия = "05.10.2017";
	
	РегистрационныеДанные.Назначение.Добавить("Документ.ПриемНаРаботу");
	РегистрационныеДанные.Назначение.Добавить("Документ.ПриемНаРаботуСписком");
	
	НоваяКоманда = РегистрационныеДанные.Команды.Добавить();
	НоваяКоманда.Представление = "Заполнение календарных графиков";
	НоваяКоманда.Идентификатор = "Заполнение календарных графиков";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	
	Возврат РегистрационныеДанные;
КонецФункции